[
  {
    "link": "https://time.com/5938425/democrats-health-care-medicaid/",
    "title": "Democrats’ Push to Expand Medicaid Depends on Red States Taking the Bait",
    "published_date": "Sun, 14 Feb 2021 13:00:04 +0000",
    "description": "Every week, Shellie Fry carefully plans out each meal she, her 81-year-old father, and her 30-year-old son will eat. She buys the least amount of food she thinks they can manage because money has been tight since her father lost his job cleaning charter buses in March, after the pandemic hit. Without health insurance, she&#8230;"
  },
  {
    "link": "https://time.com/5939368/a-love-letter-for-all-the-days-after-valentines-day/",
    "title": "A Love Letter For All the Days After Valentine’s Day",
    "published_date": "Sun, 14 Feb 2021 10:39:04 +0000",
    "description": "Giving ordinary love its beautiful due"
  },
  {
    "link": "https://time.com/5938656/new-york-nursing-homes-covid-19/",
    "title": "Thousands More COVID-19 Patients Were Sent to New York Nursing Homes Than Previously Thought",
    "published_date": "Fri, 12 Feb 2021 04:46:26 +0000",
    "description": "The figure, 9,000 patients, raises new questions as to whether Gov. Andrew Cuomo March 25 order spread sickness and death among residents."
  },
  {
    "link": "https://time.com/5937763/new-york-covid-19-vaccine-hospital-staff/",
    "title": "Exclusive: New York Tells Hospitals In Leaked Email That Staff ‘Must’ Come Before the Elderly In COVID-19 Vaccination Drive",
    "published_date": "Thu, 11 Feb 2021 19:44:01 +0000",
    "description": "The state of New York has warned hospitals that they cannot start giving COVID-19 vaccines to elderly people until they finish vaccinating hospital staff members, according to an email sent to hospitals across the state just before midnight on Feb. 5 from the governor&#8217;s vaccination chief, and obtained by TIME this week. The memo from&#8230;"
  },
  {
    "link": "https://time.com/5938128/covid-19-vaccine-rollout-biden/",
    "title": "The U.S. COVID-19 Vaccine Rollout Is Getting Faster. But Is it Enough?",
    "published_date": "Thu, 11 Feb 2021 17:20:47 +0000",
    "description": "Demand is outstripping supply, making it difficult for millions of eligible Americans to get their appointment"
  },
  {
    "link": "https://time.com/5937868/do-vaccines-stop-covid-19-spread/",
    "title": "Do Vaccines Stop the Spread of COVID-19? What You Need to Know",
    "published_date": "Thu, 11 Feb 2021 13:30:24 +0000",
    "description": "Vaccines can provide immunity to COVID-19 disease, but can they also stop the virus from spreading?"
  },
  {
    "link": "https://time.com/5935602/pandemic-kids-daycare-playdates/",
    "title": "My Kids Are in Daycare. How Should That Affect My Family’s Social Distancing Strategy?",
    "published_date": "Thu, 11 Feb 2021 13:00:06 +0000",
    "description": "Welcome to COVID Questions, TIME&#8217;s advice column. We&#8217;re trying to make living through the pandemic a little easier, with expert-backed answers to your toughest coronavirus-related dilemmas. While we can&#8217;t and don&#8217;t offer medical advice&#8212;those questions should go to your doctor&#8212;we hope this column will help you sort through this stressful and confusing time. Got a&#8230;"
  },
  {
    "link": "https://time.com/5937575/covid-19-cases-falling/",
    "title": "COVID-19 Case Counts Have Started Falling in the U.S. This May Be Why",
    "published_date": "Wed, 10 Feb 2021 15:45:58 +0000",
    "description": "After record-breaking highs in COVID-19 cases, daily diagnoses have started trending downward in the U.S"
  },
  {
    "link": "https://time.com/5937576/vaccine-rollout-priority/",
    "title": "Should Someone With Asthma Get a COVID-19 Vaccine Before Someone With Cancer? The Next Big Challenge in the Vaccine Rollout",
    "published_date": "Wed, 10 Feb 2021 13:00:48 +0000",
    "description": "Working through the vaccine priority groups has been rocky so far, but the road ahead promises to be even bumpier when people with underlying health conditions become eligible to get vaccinated. Who goes first?"
  },
  {
    "link": "https://time.com/5937651/climate-change-health-emissions/",
    "title": "Healthy Planet, Healthy People. How Slowing Climate Change Saves Lives",
    "published_date": "Wed, 10 Feb 2021 00:33:31 +0000",
    "description": "Just because the United States has re-joined the Paris Agreement doesn&#8217;t mean that the world is on a path to a better climate future. The 2015 agreement, in which signatories pledged to collectively cap global warming at &#8220;well below&#8221; 2&#176;C above pre-industrial levels, is only the first step. Member nations still have to adopt ambitious&#8230;"
  }
]